In [7]:
import pandas as pd

In [77]:
data = "000hi going good0000"
data.split('g')

['000hi ', 'oin', ' ', 'ood0000']

In [72]:
data[:8:2]

'00ig'

In [74]:
data[3]

'h'

In [84]:
data = data+'Ok'
data

'000hi going good0000OkOk'

In [86]:
data

'000hi going good0000OkOk'

In [9]:
list1 = [11,12,13,14,15]
list1[2:4]

[13, 14]

In [10]:
import seaborn as sns

In [11]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [12]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.2 KB

In [13]:
tips_sub = tips.head(10)
tips_sub

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [25]:
tips['Sex_Category'] = tips['sex'].astype(str)

In [26]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 9 columns):
total_bill        244 non-null float64
tip               244 non-null float64
sex               244 non-null category
smoker            244 non-null category
day               244 non-null category
time              244 non-null category
size              244 non-null int64
total_bill_str    244 non-null object
Sex_Category      244 non-null object
dtypes: category(4), float64(2), int64(1), object(2)
memory usage: 11.0+ KB

In [41]:
tips.head(5)

,total_bill,tip,sex,smoker,day,time,size,total_bill_str,Sex_Category
0,16.99,1.01,Female,No,Sun,Dinner,2,16.99,Female
1,10.34,1.66,Male,No,Sun,Dinner,3,10.34,Male
2,21.01,3.50,Male,No,Sun,Dinner,3,21.01,Male
3,23.68,3.31,Male,No,Sun,Dinner,2,23.68,Male
4,24.59,3.61,Female,No,Sun,Dinner,4,24.59,Female

In [28]:
tips_sub = tips.head(10)
tips_sub.loc[[1,3,5,7],'total_bill'] = 'missing'
tips_sub

/home/digambar/.local/lib/python3.5/site-packages/pandas/core/indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

,total_bill,tip,sex,smoker,day,time,size,total_bill_str,Sex_Category
0,16.99,1.01,Female,No,Sun,Dinner,2,16.99,Female
1,missing,1.66,Male,No,Sun,Dinner,3,10.34,Male
2,21.01,3.50,Male,No,Sun,Dinner,3,21.01,Male
3,missing,3.31,Male,No,Sun,Dinner,2,23.68,Male
4,24.59,3.61,Female,No,Sun,Dinner,4,24.59,Female
5,missing,4.71,Male,No,Sun,Dinner,4,25.29,Male
6,8.77,2.00,Male,No,Sun,Dinner,2,8.77,Male
7,missing,3.12,Male,No,Sun,Dinner,4,26.88,Male
8,15.04,1.96,Male,No,Sun,Dinner,2,15.04,Male
9,14.78,3.23,Male,No,Sun,Dinner,2,14.78,Male

In [30]:
tips_sub.dtypes

total_bill          object
tip                float64
sex               category
smoker            category
day               category
time              category
size                 int64
total_bill_str      object
Sex_Category        object
dtype: object

In [33]:
tips_sub['total_bill_str'].astype(float)

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
6     8.77
7    26.88
8    15.04
9    14.78
Name: total_bill_str, dtype: float64

In [35]:
tips_sub.dtypes

total_bill          object
tip                float64
sex               category
smoker            category
day               category
time              category
size                 int64
total_bill_str      object
Sex_Category        object
dtype: object

In [44]:
pd.to_numeric(tips_sub['total_bill'],errors='coerse')

0    16.99
1      NaN
2    21.01
3      NaN
4    24.59
5      NaN
6     8.77
7      NaN
8    15.04
9    14.78
Name: total_bill, dtype: float64

In [62]:
df = pd.DataFrame(
    [['Rakesh','Male',24],['Bikash','Male',26],['Swati','Female',22]],columns = ['Name','Sex','Age'],
    index=['A','B','C'],dtype='float'
)
df

     Name     Sex   Age
A  Rakesh    Male  24.0
B  Bikash    Male  26.0
C   Swati  Female  22.0

In [67]:
df.loc['B':'C']

     Name     Sex   Age
B  Bikash    Male  26.0
C   Swati  Female  22.0

In [60]:
df.dtypes

Name     object
Sex      object
Age     float64
dtype: object